# Data Cleaning

In [53]:
import pandas as pd

In [54]:
df = pd.read_csv("/home/nineleaps/Python_training/data/cap_rooms.csv")
df.head()

,ID,City,Location,PType,PPN,Nights,Beds,Baths,Reviews,Recent
0,IND137,Mumbai,NaN,Entire Home/Apartment,"₹3,200",2.0,1.0,1.0,4.0,2022-03-12
1,IND138,Bangalor,Indiranagar,Private Room,1800,NaN,1.0,1.0,2.0,15-Feb-23
2,IND139,Delhi,Hauz Khas,Entire Home/Apartment,₹4200,3.0,2.0,2.0,NaN,2021/12/25
3,IND140,Chennai,Teynampet,Shared Room,"₹1,000",1.0,NaN,1.0,1.0,"May 5, 2022"
4,IND141,Hyderabad,Jubilee Hills,Entire Home/Apartment,3800,3.0,3.0,3.0,5.0,2022-08-20 14:00

In [55]:
df.isna().sum()

ID           0
City         0
Location     2
PType        0
PPN          0
Nights       1
Beds         8
Baths        7
Reviews      9
Recent       0
dtype: int64

In [56]:
df['Nights'] = df.Nights.fillna(df.Nights.mean())
df['Beds'] = df.Beds.fillna(df.Beds.median())
df['Baths'] = df.Baths.fillna(df.Baths.median())
df['Reviews'] = df.Reviews.fillna(df.Reviews.mean())

In [57]:
df.isna().sum()

ID           0
City         0
Location     2
PType        0
PPN          0
Nights       0
Beds         0
Baths        0
Reviews      0
Recent       0
dtype: int64

In [58]:
df["Location "] = df['Location '].fillna("Unknown")

In [59]:
df.isna().sum()

ID           0
City         0
Location     0
PType        0
PPN          0
Nights       0
Beds         0
Baths        0
Reviews      0
Recent       0
dtype: int64

In [60]:
df.City.unique()

array(['Mumbai', 'Bangalor', 'Delhi', 'Chennai', 'Hyderabad', 'Pune',
       'Kolkata', 'Bangalore', 'Hydrabad', 'Delhi '], dtype=object)

In [61]:
df['City'] = df.City.replace(
    {
    'Bangalor$' : 'Bangalore',
    'Delhi ' : 'Delhi',
    'Hydrabad' : 'Hyderabad'
    },
regex = True
)
df['City'].unique()

array(['Mumbai', 'Bangalore', 'Delhi', 'Chennai', 'Hyderabad', 'Pune',
       'Kolkata'], dtype=object)

In [62]:
df.PPN.unique()

array(['₹3,200', '1800', '₹4200', '₹1,000', '3800', '₹2,500', '₹2800',
       '₹800', '₹5200', 'One Thousand Five Hundred', '₹4500', '₹1200',
       '₹900', '₹3800', 'Two Thousand', '₹3200', '₹600', '₹5800', '₹1000',
       '₹4800', '₹5000', '₹1500', '₹700', 'Eight Hundred', '₹500',
       '₹6500', '₹1800', '₹7500', '₹5500', '₹6800', '₹6200', '₹7000',
       '₹8000'], dtype=object)

In [63]:
df['PPN'] = df.PPN.replace(
    {
    '₹' : '',
    ',' : '',
    'One Thousand Five Hundred' : 1500,
    'Two Thousand' : 2000,
    'Eight Hundred' : 800,

    },
regex = True
).astype(int)
df.head()

,ID,City,Location,PType,PPN,Nights,Beds,Baths,Reviews,Recent
0,IND137,Mumbai,Unknown,Entire Home/Apartment,3200,2.000000,1.0,1.0,4.000000,2022-03-12
1,IND138,Bangalore,Indiranagar,Private Room,1800,1.959184,1.0,1.0,2.000000,15-Feb-23
2,IND139,Delhi,Hauz Khas,Entire Home/Apartment,4200,3.000000,2.0,2.0,3.853659,2021/12/25
3,IND140,Chennai,Teynampet,Shared Room,1000,1.000000,2.0,1.0,1.000000,"May 5, 2022"
4,IND141,Hyderabad,Jubilee Hills,Entire Home/Apartment,3800,3.000000,3.0,3.0,5.000000,2022-08-20 14:00

In [64]:
from dateutil import parser
def format_date(date_str):
        return pd.to_datetime(parser.parse(str(date_str))).strftime('%Y-%m-%d')
 
df['Recent'] = df['Recent'].apply(format_date)
df.head()

,ID,City,Location,PType,PPN,Nights,Beds,Baths,Reviews,Recent
0,IND137,Mumbai,Unknown,Entire Home/Apartment,3200,2.000000,1.0,1.0,4.000000,2022-03-12
1,IND138,Bangalore,Indiranagar,Private Room,1800,1.959184,1.0,1.0,2.000000,2023-02-15
2,IND139,Delhi,Hauz Khas,Entire Home/Apartment,4200,3.000000,2.0,2.0,3.853659,2021-12-25
3,IND140,Chennai,Teynampet,Shared Room,1000,1.000000,2.0,1.0,1.000000,2022-05-05
4,IND141,Hyderabad,Jubilee Hills,Entire Home/Apartment,3800,3.000000,3.0,3.0,5.000000,2022-08-20

In [65]:
df.to_csv('cleaned_data.csv', index=False)

In [68]:
pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 250.9/250.9 KB 1.4 MB/s eta 0:00:00a 0:00:01
Collecting et-xmlfile
  Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

In [69]:
df_csv = pd.read_csv('cleaned_data.csv')
df_csv.to_excel('cleaned_data.xlsx', index=False, engine='openpyxl')